[Killed] ConditionalExpression
main/components/Articles/ArticleForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="ArticleForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: ArticleForm tests renders correctly when passing in a Article
statusReason: Error: Unable to find an element by: [data-testid="/ArticleForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticleForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="ArticleForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: ArticleForm tests renders correctly when passing in a Article
statusReason: Error: Unable to find an element by: [data-testid="/ArticleForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.js:60:47
                         id="title"
                         type="text"
                         isInvalid={Boolean(errors.name)}
-                        {...register("title", {
-                            required: "Title is required."
-                        })}
+                        {...register("title", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Title is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.js:97:55
                             id="dateAdded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateAdded)}
-                            {...register("dateAdded", { required: "Date Added is required.", pattern: { value: isodate_regex, message: "Date Added must be in ISO format" } })}
+                            {...register("dateAdded", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticleForm.js:97:42
                             id="dateAdded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateAdded)}
-                            {...register("dateAdded", { required: "Date Added is required.", pattern: { value: isodate_regex, message: "Date Added must be in ISO format" } })}
+                            {...register("", { required: "Date Added is required.", pattern: { value: isodate_regex, message: "Date Added must be in ISO format" } })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
