[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:3:49
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HelpRequestCreatePage() {
-
-    // Stryker disable all : placeholder for future implementation
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Create page not yet implemented</h1>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function HelpRequestCreatePage() {}
 
killedBy: HelpRequestCreatePage tests Renders expected content
statusReason: Error: HelpRequestCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
