[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestIndexPage.js:3:48
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HelpRequestIndexPage() {
-
-    // Stryker disable all : placeholder for future implementation
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Index page not yet implemented</h1>
-                <p><a href="/placeholder/create">Create</a></p>
-                <p><a href="/placeholder/edit/1">Edit</a></p>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function HelpRequestIndexPage() {}
 
killedBy: HelpRequestIndexPage tests Renders expected content
statusReason: Error: HelpRequestIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
