[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.js:3:47
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function HelpRequestEditPage() {
-
-    // Stryker disable all : placeholder for future implementation
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit page not yet implemented</h1>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function HelpRequestEditPage() {}
 
killedBy: HelpRequestEditPage tests Renders expected content
statusReason: Error: HelpRequestEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
