[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:30:14
     return(
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Col>
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">Id</Form.Label>
-                        <Form.Control
-                            data-testid={testIdPrefix + "-id"}
-                            id="id"
-                            type="number"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                </Col>
-            )}
+            {true}
 
             <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:30:14
     return(
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Col>
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">Id</Form.Label>
-                        <Form.Control
-                            data-testid={testIdPrefix + "-id"}
-                            id="id"
-                            type="number"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                </Col>
-            )}
+            {false}
 
             <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:59:26
                         })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.itemId?.message && "A valid menu item ID is required."}
+                        {errors.itemId?.message || "A valid menu item ID is required."}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">A valid menu item ID is required.</div> instead

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:59:26
                         })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.itemId?.message && "A valid menu item ID is required."}
+                        {errors.itemId.message && "A valid menu item ID is required."}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:70:54
                         id="dateReviewed"
                         type="datetime-local"
                         isInvalid={Boolean(errors.localDateTime)}
-                        {...register("dateReviewed", {
-                            required: "This field can't be blank.",
-                            pattern: isodate_regex
-                        })}
+                        {...register("dateReviewed", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid date in iso format is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:71:39
                         type="datetime-local"
                         isInvalid={Boolean(errors.localDateTime)}
                         {...register("dateReviewed", {
-                            required: "This field can't be blank.",
+                            required: "",
                             pattern: isodate_regex
                         })}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid date in iso format is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:76:26
                         })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.dateReviewed && 'A valid date in iso format is required. See more here: https://en.wikipedia.org/wiki/ISO_8601'}
+                        {false}
                         {errors.dateReviewed?.message}
                     </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid date in iso format is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:76:26
                         })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.dateReviewed && 'A valid date in iso format is required. See more here: https://en.wikipedia.org/wiki/ISO_8601'}
+                        {true}
                         {errors.dateReviewed?.message}
                     </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid date in iso format is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:77:26
                     />
                     <Form.Control.Feedback type="invalid">
                         {errors.dateReviewed && 'A valid date in iso format is required. See more here: https://en.wikipedia.org/wiki/ISO_8601'}
-                        {errors.dateReviewed?.message}
+                        {errors.dateReviewed.message}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:90:55
                         id="reviewerEmail"
                         type="text"
                         isInvalid={Boolean(errors.reviewerEmail)}
-                        {...register("reviewerEmail", {
-                            required: "Your email is required",
-                        })}
+                        {...register("reviewerEmail", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Your email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:107:39
                         type="number"
                         isInvalid={Boolean(errors.stars)}
                         {...register("stars", {
-                            required: "A valid number is required.",
+                            required: "",
                             min: {
                                 value: 1,
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid number is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:108:34
                         isInvalid={Boolean(errors.stars)}
                         {...register("stars", {
                             required: "A valid number is required.",
-                            min: {
-                                value: 1,
-                                message: "Minimum 1 star"
-                            },
+                            min: {},
                             max: {
                                 value: 5,
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Minimum 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:114:42
                             },
                             max: {
                                 value: 5,
-                                message: "Maximum 5 stars"
+                                message: ""
                             }
                         })}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Maximum 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:131:34
                     id="comment"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("comment", {
+                    {...register("", {
                         required: "A comment is required.",
                     })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:132:35
                     type="text"
                     isInvalid={Boolean(errors.name)}
                     {...register("comment", {
-                        required: "A comment is required.",
+                        required: "",
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A comment is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:136:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.comment?.message}
+                    {errors.comment.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
