[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:57:72
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: true})}
+                            {...register("requesterEmail", { required: false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:60:30
                             {...register("requesterEmail", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester Email is required.'}
+                            {errors.requesterEmail || 'Requester Email is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

<label
  class="form-label"
  for="requesterEmail"
>

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:72:72
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true})}
+                            {...register("professorEmail", { required: false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:72:42
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true})}
+                            {...register("", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:138:50
                             id="done"
                             type="boolean"
                             isInvalid={Boolean(errors.done)}
-                            {...register("done", {
-                                required: true
-                            })}
+                            {...register("done", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:139:43
                             type="boolean"
                             isInvalid={Boolean(errors.done)}
                             {...register("done", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
