[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:39:30
                     required: "orgCode is required.",
                     maxLength: {
                     value: 30,
-                    message: "Max length is 30 characters."
+                    message: ""
                     }
                 })}
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length is 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
